import { defineStore } from 'pinia';

export const useStockStore = defineStore('stock', {
  state: () => ({
    selectedStock: '삼성전자',
    stockMapping: {
      '삼성에스디에스': '018260',
      '넥슨게임즈': '225570',
      '카카오': '035720',
      'NAVER': '035420',
      'CJ제일제당': '097950',
      '농심': '004370',
      '하이트진로': '000080',
      '오뚜기': '389500',
      'SK텔레콤': '017670',
      'KT': '030200',
      '삼성바이오로직스': '207940',
      '셀트리온': '068270',
      '오리엔트바이오': '002630',
      '미래에셋생명': '085620',
      '삼보산업': '009620',
      '한화생명': '088350',
      '현대차': '005380',
      '기아': '000270',
      '한국전력': '015760',
      'POSCO홀딩스': '005490',
      '삼성전자': '005930',
      'SK하이닉스': '000660',
      'YG PLUS': '037270',
      'JYP Ent.': '035900',
      '에스엠': '041510',
      'CJ CGV': '079160',
      'GS건설': '006360',
      'KD': '044180',
      '대한항공': '003490',
      'CJ대한통운': '000120',
      '제주항공': '089590',
      'SK이노베이션': '096770',
      'S-Oil': '010950',
      '롯데케미칼': '011170',
      'LG화학': '051910',
      '에스에너지': '095910',
      '메가스터디교육': '215200',
      '웅진씽크빅': '095720',
      'KB금융': '105560',
      '우리금융지주': '316140',
      // 다른 매핑도 추가할 수 있습니다
    }
  }),
  getters: {
    stockUrl: (state) => {
      const stockCode = state.stockMapping[state.selectedStock];
      return stockCode ? `http://127.0.0.1:8000/api/stocks/${stockCode}/` : '';
    }
  },
  actions: {
    setSelectedStock(stock) {
      this.selectedStock = stock;
    }
  }
});